awscli
berkeley-db@5
binutils
bzip2
ca-certificates
cairo
certifi
cffi
checkov
concurrencykit
cryptography
dbus
dive
expat
fontconfig
fq
freetype
fzf
gcc
glib
glow
gmp
graphite2
grex
hadolint
harfbuzz
helm
hyperfine
icu4c@77
isl
jlog
jq
k9s
kubernetes-cli
libedit
libffi
libice
libmpc
libpng
libsm
libx11
libxau
libxcb
libxcrypt
libxdmcp
libxext
libxmu
libxrender
libxt
libyaml
lz4
lzo
mandoc
mani
minikube
mpdecimal
mpfr
navi
ncurses
numpy
oniguruma
openblas
openssl@3
opentofu
pcre2
pixman
pre-commit
presenterm
pycparser
python@3.13
readline
silicon
sops
sqlite
tealdeer
tflint
trivy
unzip
util-linux
uv
xclip
xorgproto
xz
yq
zlib
zstd
